Revit 2026 API

# ColorFillSchemeParameterDefinition Property

---

Represents the parameter of the elements that this scheme could be used to color.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ParameterDefinition { get; set; }
```
```vb
Public Property ParameterDefinition As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ParameterDefinition {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ParameterDefinition : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The paramId cannot be applied to the scheme. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When this property changed, all existing scheme entries will be removed from the scheme, and the value of IsByRange property will be set to false if the parameter storage type is not numeric.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace